export const StatusMap: Record<string, string> = {
  '14': ' 力量 %+d',
  '15': ' 力量 %+d％',
  '18': ' 幸运 %+d',
  '19': ' 幸运 %+d％',
  '22': ' 魔法力 %+d',
  '23': ' 魔法力 %+d％',
  '26': ' 体力 %+d',
  '27': ' 体力 %+d％',
  '30': ' 最大生命值 %+d',
  '31': ' 最大生命值 %+d％',
  '34': ' 最大法力值 %+d',
  '35': ' 最大法力值 %+d％',
  '38': ' 属性力 %+d',
  '39': ' 属性力 %+d％',
  '54': ' 休息 恢复HP %+d',
  '55': ' 休息 恢复HP %+d％',
  '58': ' 休息 恢复SP %+d',
  '59': ' 休息 恢复SP %+d％',
  '62': ' 最大攻击力 %+d',
  '63': ' 最大攻击力 %+d％',
  '66': ' 最小攻击力 %+d',
  '67': ' 最小攻击力 %+d％',
  '70': ' 魔法抵抗力 %+d',
  '71': ' 魔法抵抗力 %+d％',
  '82': ' 地抵抗力 %+d',
  '86': ' 最终减伤 %+d％',
  '90': ' 物理最小伤害 %+d％',
  '94': ' 物理最大伤害 %+d％',
  '98': ' 魔法最小伤害 %+d％',
  '99': ' 最终魔法最小伤害 %+d％',
  '102': ' 魔法最大伤害 %+d％',
  '106': ' 移动速度 %+d',
  '107': ' 移动速度 %+d％',
  '110': ' 弹跳力 %+d',
  '111': ' 弹跳力 %d％',
  '114': ' 绳索移动速度 %+d',
  '115': ' 绳索移动速度 %+d％',
  '118': ' 梯子移动速度 %+d',
  '119': ' 梯子移动速度 %+d％',
  '124': ' 经验值获取 %+d％',
  '128': ' 金钱获取 %+d％',
  '132': ' 物品掉落概率 %+d％',
  '136': ' 多属性掉落概率 %+d％',
  '140': ' 物理伤害 %+d',
  '144': ' 物理伤害减少 %+d',
  '145': ' 物理伤害减少 %+d％',
  '148': ' 物理贯穿力 %+d％',
  '156': ' 暴击伤害 %+d％',
  '157': ' 最终暴击伤害 %+d％',
  '158': ' 暴击概率 %+d％',
  '159': ' 基础暴击概率 %+d％',
  '162': ' 魔法暴击伤害 %+d％',
  '163': ' 最终魔法暴击伤害 %+d％',
  '164': ' 魔法暴击概率 %+d％',
  '165': ' 基础魔法暴击概率 %+d％',
  '168': ' 治疗暴击恢复量 %+d％',
  '176': ' 物理命中率 %+d％',
  '177': ' 物理命中率 %+d％',
  '180': ' 魔法命中率 %+d％',
  '181': ' 魔法命中率 %+d％',
  '184': ' 物理躲闪率 %+d％',
  '185': ' 物理躲闪率 %+d％',
  '188': ' 魔法躲闪率 %+d％',
  '189': ' 魔法躲闪率 %+d％',
  '192': ' 物理背击伤害 %+d％',
  '196': ' 魔法背击伤害 %+d％',
  '216': ' 防御力 %+d',
  '217': ' 防御力 %+d％',
  '218': ' 属性力伤害(物理) %+d',
  '232': ' 生命值痊愈效果 %+d％',
  '240': ' 魔法伤害 %+d',
  '244': ' 魔法伤害减少 %+d',
  '254': ' 属性力最小伤害 %+d％',
  '258': ' 属性力最大伤害 %+d％',
  '292': ' 魔法贯穿力 %+d％',
  '296': ' 生命值基础治疗量 %+d％',
  '307': ' 毒伤害（毒发生时） %+d',
  '311': ' 出血伤害（出血发生时） %+d',
  '331': ' 毒抵抗力 %d％',
  '389': ' 竞技点 %+d％',
  '440': ' 技能冷却时间减少 %+d‰',
  '454': ' 钓鱼额外获得几率 %+d％',
  '455': ' 所有属性 %+d',
  '456': ' 所有属性 %+d％',
  '461': ' 物理/魔法 最大伤害 %+d％',
  '462': ' 物理/魔法 最小伤害 %+d％',
  '463': ' 物理/魔法 贯穿力 %+d％',
  '464': ' 物理/魔法 爆击伤害 %+d％',
  '465': ' 物理/魔法 爆击率 %+d％',
  '466': ' 物理/魔法 命中率 %+d％',
  '488': ' 任务奖励经验/金钱 %+d％',
  '490': ' 物理 最大/最小伤害 %+d%',
  '491': ' 魔法 最大/最小伤害 %+d%',
  '492': ' 最大/最小 攻击力 %+d%',
  '493': ' 最大/最小 攻击力 %+d％',
  '495': ' 物理/魔法 伤害减少 %+d',
  '496': ' 物理/魔法 伤害增加 %+d',
  '497': ' 物理/魔法 躲闪率 %+d%',
  '508': ' 人品 %+d',
  '515': ' 最大黑暗卡牌 %+d',
  '520': ' 最大魔力卡牌 %+d',
  '525': ' 魔力卡牌充能时间减少 %+d‰',
  '526': ' 所有卡牌充能时间减少 %+d‰',
  '533': ' 所有卡牌最大值 %+d',
  '566': ' 普通怪物伤害 %+d',
  '570': ' 精锐怪物伤害 %+d',
  '573': ' 普通怪物支配力 %+d‰',
  '574': ' 精锐怪物支配力 %+d‰',
  '1525': ' 韧性 %+d',
  '1527': ' 格挡 %+d',
  '1604': ' 最大属性卡牌 %+d',
  '1609': ' 最大光明卡牌 %+d',
};

/**
 * 物理排除状态
 */
export const PhyExcludeTypes = [38, 102];
/**
 * 魔法排除状态
 */
export const MagicExcludeTypes = [62, 66, 90, 94, 156, 492];

export const StatusScoreMap: Record<string, number> = {
  /**
   * 不知道是什么需要排查下 看看什么原因 自己账号力量斗兽头
   */
  0: 0,
  /**
   * 力量
   */
  14: 0,
  /**
   * 幸运
   */
  18: 0,
  /**
   * 魔法力
   */
  22: 0,
  /**
   * 体力
   */
  26: 5,
  /**
   * 最大生命值
   */
  30: 1,
  /**
   * 最大生命值%
   */
  31: 2000,
  /**
   * 最大法力值
   */
  34: 0,
  /**
   * 属性力
   */
  38: 200,
  /**
   * 休息 恢复HP%
   */
  55: 0,
  /**
   * 最大攻击力
   */
  62: 100,
  /**
   * 最小攻击力
   */
  66: 100,
  /**
   * 魔法抵抗力
   */
  70: 5,
  /**
   * 最终减伤
   */
  86: 30000,
  /**
   * 物理最小伤害
   */
  90: 200,
  /**
   * 物理最大伤害
   */
  94: 200,
  /**
   * 魔法最大伤害
   */
  102: 200,
  /**
   * 移动速度
   */
  106: 100,
  /**
   * 经验值获取
   */
  124: 0,
  /**
   * 金钱获取
   */
  128: 0,
  /**
   * 多属性发生概率
   */
  136: 0,
  /**
   * 物理伤害
   */
  140: 0,
  /**
   * 物理伤害减少
   */
  144: 10,
  /**
   * 物理贯穿力
   */
  148: 100,
  /**
   * 物理/魔法 贯穿力
   */
  463: 100,
  /**
   * 暴击伤害
   */
  156: 100,
  /**
   * 爆击率
   */
  158: 1000,
  /**
   * 魔法暴击伤害
   */
  162: 100,
  /**
   * 魔法暴击概率
   */
  164: 1000,
  /**
   * 物理攻击命中率
   */
  176: 100,
  /**
   * 魔法攻击命中率
   */
  180: 100,
  /**
   * 物理/魔法 命中率
   */
  466: 100,
  /**
   * 物理躲闪率
   */
  184: 10,
  /**
   * 防御力
   */
  216: 5,
  /**
   * 防御力%
   */
  217: 1000,
  /**
   * 魔法伤害
   */
  240: 10,
  /**
   * 魔法伤害减少
   */
  244: 10,
  /**
   * 所有属性
   */
  455: 10,
  /**
   * 物理/魔法 最大伤害
   */
  461: 100,
  /**
   * 物理/魔法 最小伤害
   */
  462: 100,
  /**
   * 物理/魔法 爆击伤害
   */
  464: 100,
  /**
   * 物理/魔法 爆击率
   */
  465: 1000,
  /**
   * 最大/最小 攻击力
   */
  492: 200,
  /**
   * 物理/魔法 伤害减少
   */
  495: 10,
  /**
   * 普通怪物伤害
   */
  566: 10,
  /**
   * 精锐怪物伤害
   */
  570: 10,
  /**
   * 普通怪物支配力‰
   */
  573: 2000,
  /**
   * 精锐怪物支配力‰
   */
  574: 2000,
  /**
   * 韧性
   */
  1525: 30,
  /**
   * 格挡
   */
  1527: 30,
};
